app/controllers/books_controller.rb

	def update
		book = Book.find(params[:id])
		if book.update(book_params)
			flash[:notice] = "successfully"
			redirect_to book_path(book)
		else
			flash[:notice] = "error"
			@book = Book.new
			@user = current_user
			@books = Book.all
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "yes"], ["updated_at", "2020-02-04 09:58:30.835438"], ["id", 19]]
SELECT "books".* FROM "books"

	def create
  	book = Book.new(book_params)
  	book.user_id = current_user.id
 		if book.save
 			flash[:notice] = "successfully"
 			redirect_to book_path(book)
  		else
  			flash[:notice] = "error"
  			@user = current_user
  			@books = Book.all
---
INSERT INTO "books" ("title", "user_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test1"], ["user_id", 2], ["body", "123456qwe"], ["created_at", "2020-02-05 06:04:36.022628"], ["updated_at", "2020-02-05 06:04:36.022628"]]
SELECT "books".* FROM "books"

	def correct_user
		book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]