app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @user = current_user
    @users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", "Hello World"], ["profile_image_id", "22e0db727802b10c642cba858c97ce081ec7964d9c8e2c75bbe57c51be55"], ["updated_at", "2020-02-02 07:39:30.768975"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def correct_user
    user = User.find(params[:id])